In [1]:
import numpy as np
import pandas as pd

In [5]:
np.random.seed(42)

seri = pd.Series(np.random.randint(0, 50, 8))
seri

0    38
1    28
2    14
3    42
4     7
5    20
6    38
7    18
dtype: int32

In [6]:
seri.size

8

In [7]:
seri.shape

(8,)

In [9]:
seri.ndim

1

In [12]:
seri.head() #varsayılan değer 5. en baştan 5 değeri gösterir.

0    38
1    28
2    14
3    42
4     7
dtype: int32

In [13]:
seri.head(3)

0    38
1    28
2    14
dtype: int32

In [14]:
seri.tail() #sondan 5 satır döndürür. varsayılan 5 tir.

3    42
4     7
5    20
6    38
7    18
dtype: int32

In [15]:
seri.tail(3)

5    20
6    38
7    18
dtype: int32

In [24]:
seri.sample() # rastgele bir satır döndürür.

5    20
dtype: int32

In [25]:
seri.sample(3)

2    14
0    38
4     7
dtype: int32

In [26]:
seri.sort_values()

4     7
2    14
7    18
5    20
1    28
0    38
6    38
3    42
dtype: int32

In [27]:
seri.sort_values(ascending=False) # ascending parametresinin varsayalanı True dur. False yapılırsa büyükten küçüğe sıralama yapar

3    42
0    38
6    38
1    28
5    20
7    18
2    14
4     7
dtype: int32

In [32]:
seri.sort_index()

0    38
1    28
2    14
3    42
4     7
5    20
6    38
7    18
dtype: int32

In [33]:
seri.sort_index(ascending=False)

7    18
6    38
5    20
4     7
3    42
2    14
1    28
0    38
dtype: int32

# DataFrame

## Creating a DataFrame

### Creating a DataFrame Using the Lists of Data & Columns

In [34]:
list_1 = [[1,2,3],[4,5,6]]

column_name = ["A", "B", "C"]

df = pd.DataFrame(data = list_1, columns= column_name)
df

   A  B  C
0  1  2  3
1  4  5  6

In [35]:
?pd.DataFrame

Init signature:
pd.DataFrame(
    data=None,
    index: 'Axes | None' = None,
    columns: 'Axes | None' = None,
    dtype: 'Dtype | None' = None,
    copy: 'bool | None' = None,
) -> 'None'
Docstring:
Two-dimensional, size-mutable, potentially heterogeneous tabular data.

Data structure also contains labeled axes (rows and columns).
Arithmetic operations align on both row and column labels. Can be
thought of as a dict-like container for Series objects. The primary
pandas data structure.

Parameters
----------
data : ndarray (structured or homogeneous), Iterable, dict, or DataFrame
    Dict can contain Series, arrays, constants, dataclass or list-like objects. If
    data is a dict, column order follows insertion-order. If a dict contains Series
    which have an index defined, it is aligned by its index. This alignment also
    occurs if data is a Series or a DataFrame itself. Alignment is done on
    Series/DataFrame inputs.

    If data is a list of dicts, column order follows insertion-order.

index : Index or array-like
    Index to use for resulting frame. Will default to RangeIndex if
    no indexing information part of input data and no index provided.
columns : Index or array-like
    Column labels to use for resulting frame when data does not have them,
    defaulting to RangeIndex(0, 1, 2, ..., n). If data contains column labels,
    will perform column selection instead.
dtype : dtype, default None
    Data type to force. Only a single dtype is allowed. If None, infer.
copy : bool or None, default None
    Copy data from inputs.
    For dict data, the default of None behaves like ``copy=True``.  For DataFrame
    or 2d ndarray input, the default of None behaves like ``copy=False``.
    If data is a dict containing one or more Series (possibly of different dtypes),
    ``copy=False`` will ensure that these inputs are not copied.

    .. versionchanged:: 1.3.0

See Also
--------
DataFrame.from_records : Constructor from tuples, also record arrays.
DataFrame.from_dict : From dicts of Series, arrays, or dicts.
read_csv : Read a comma-separated values (csv) file into DataFrame.
read_table : Read general delimited file into DataFrame.
read_clipboard : Read text from clipboard into DataFrame.

Notes
-----
Please reference the :ref:`User Guide <basics.dataframe>` for more information.

Examples
--------
Constructing DataFrame from a dictionary.

>>> d = {'col1': [1, 2], 'col2': [3, 4]}
>>> df = pd.DataFrame(data=d)
>>> df
   col1  col2
0     1     3
1     2     4

Notice that the inferred dtype is int64.

>>> df.dtypes
col1    int64
col2    int64
dtype: object

To enforce a single dtype:

>>> df = pd.DataFrame(data=d, dtype=np.int8)
>>> df.dtypes
col1    int8
col2    int8
dtype: object

Constructing DataFrame from a dictionary including Series:

>>> d = {'col1': [0, 1, 2, 3], 'col2': pd.Series([2, 3], index=[2, 3])}
>>> pd.DataFrame(data=d, index=[0, 1, 2, 3])
   col1  col2
0     0   NaN
1     1   NaN
2     2   2.0
3     3   3.0

Constructing DataFrame from numpy ndarray:

>>> df2 = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]),
...                    columns=['a', 'b', 'c'])
>>> df2
   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

Constructing DataFrame from a numpy ndarray that has labeled columns:

>>> data = np.array([(1, 2, 3), (4, 5, 6), (7, 8, 9)],
...                 dtype=[("a", "i4"), ("b", "i4"), ("c", "i4")])
>>> df3 = pd.DataFrame(data, columns=['c', 'a'])
...
>>> df3
   c  a
0  3  1
1  6  4
2  9  7

Constructing DataFrame from dataclass:

>>> from dataclasses import make_dataclass
>>> Point = make_dataclass("Point", [("x", int), ("y", int)])
>>> pd.DataFrame([Point(0, 0), Point(0, 3), Point(2, 3)])
   x  y
0  0  0
1  0  3
2  2  3

Constructing DataFrame from Series/DataFrame:

>>> ser = pd.Series([1, 2, 3], index=["a", "b", "c"])
>>> df = pd.DataFrame(data=ser, index=["a", "c"])
>>> df
   0
a  1
c  3

>>> df1 = pd.DataFrame([1, 2, 3], index=["a", "b", "c"], columns=["x"])
>>> df2 = pd.DataFrame(data=df1, index=["a", "c"])
>>> df2
   x
a  1
c  3
File:           c:\users\bahad\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages\pandas\core\frame.py
Type:           type
Subclasses:     SubclassedDataFrame

In [36]:
list_1 = [[1,2,3],[4,5,6]]

column_name = ["A", "B", "C", "D"]

df = pd.DataFrame(data = list_1, columns= column_name)
df

ValueError: 4 columns passed, passed data had 3 columns

### Creating a DataFrame Using a Numpy Arrays

In [37]:
arr1 = np.arange(1,27,3).reshape(3,3)
arr1

array([[ 1,  4,  7],
       [10, 13, 16],
       [19, 22, 25]])

In [38]:
arr1.ndim

2

In [39]:
arr1.shape

(3, 3)

In [42]:
df = pd.DataFrame(data= arr1)
df

    0   1   2
0   1   4   7
1  10  13  16
2  19  22  25

In [44]:
df = pd.DataFrame(arr1, columns=["A1","A2","A3"])
df

   A1  A2  A3
0   1   4   7
1  10  13  16
2  19  22  25

In [46]:
df = pd.DataFrame(arr1, ["A1","A2","A3"], ["B1", "B2", "B3"])
df

    B1  B2  B3
A1   1   4   7
A2  10  13  16
A3  19  22  25

### Creating a DataFrame Using a Dictionaries

In [55]:
dict = {'Name':['Ayşe', 'Ahmet', 'Mehmet'],'Age':[20,30,40]}
dict

{'Name': ['Ayşe', 'Ahmet', 'Mehmet'], 'Age': [20, 30, 40]}

In [56]:
pd.Series(dict)

Name    [Ayşe, Ahmet, Mehmet]
Age              [20, 30, 40]
dtype: object

In [57]:
pd.DataFrame(data = dict)   # parametre = argument

     Name  Age
0    Ayşe   20
1   Ahmet   30
2  Mehmet   40

In [58]:
dict

{'Name': ['Ayşe', 'Ahmet', 'Mehmet'], 'Age': [20, 30, 40]}

In [61]:
pd.DataFrame(dict, columns= ["Name", "Age", "Job"])

     Name  Age  Job
0    Ayşe   20  NaN
1   Ahmet   30  NaN
2  Mehmet   40  NaN

In [63]:
aa = pd.DataFrame(dict, columns= ["aa", "bb", "cc"])
aa

Empty DataFrame
Columns: [aa, bb, cc]
Index: []

In [64]:
aa.shape

(0, 3)

In [65]:
bb = pd.DataFrame(dict, columns= ["Name", "bb", "cc"])
bb

     Name   bb   cc
0    Ayşe  NaN  NaN
1   Ahmet  NaN  NaN
2  Mehmet  NaN  NaN

In [66]:
bb.shape

(3, 3)

In [72]:
df = pd.DataFrame(dict, columns= ["Name", "Age", "cc"])
df

     Name  Age   cc
0    Ayşe   20  NaN
1   Ahmet   30  NaN
2  Mehmet   40  NaN

## DataFrame Methods

In [70]:
dict_1 = {'Name':['Ayşe', 'Ahmet', 'Mehmet'],'Age':[20,30,40]}
dict_1

{'Name': ['Ayşe', 'Ahmet', 'Mehmet'], 'Age': [20, 30, 40]}

In [74]:
df = pd.DataFrame(dict_1)
df

     Name  Age
0    Ayşe   20
1   Ahmet   30
2  Mehmet   40

In [78]:
df.head()

     Name  Age
0    Ayşe   20
1   Ahmet   30
2  Mehmet   40

In [76]:
df.tail()

     Name  Age
0    Ayşe   20
1   Ahmet   30
2  Mehmet   40

In [85]:
df.sample()

     Name  Age
2  Mehmet   40

In [87]:
df.columns

Index(['Name', 'Age'], dtype='object')

In [88]:
df.columns[0]

'Name'

In [89]:
df.columns[1]

'Age'

In [90]:
df.columns[2]

IndexError: index 2 is out of bounds for axis 0 with size 2

In [91]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [92]:
df

     Name  Age
0    Ayşe   20
1   Ahmet   30
2  Mehmet   40

In [100]:
df["Age"].mean()

30.0

In [101]:
df.Age

0    20
1    30
2    40
Name: Age, dtype: int64

In [102]:
df.Age.mean()

30.0

## Indexing, Slicing and Selection

In [103]:
data={"isim":["Ali", "Ayşe", "Fatma", "Veli"], "boy cm":[170,160,170,180], "kilo-kg":[70, 55, 60, 80]}
data

{'isim': ['Ali', 'Ayşe', 'Fatma', 'Veli'],
 'boy cm': [170, 160, 170, 180],
 'kilo-kg': [70, 55, 60, 80]}

In [106]:
df = pd.DataFrame(data= data, index= ["A", "B", "C", "D"])
df

    isim  boy cm  kilo-kg
A    Ali     170       70
B   Ayşe     160       55
C  Fatma     170       60
D   Veli     180       80

In [107]:
df.shape

(4, 3)

In [108]:
df.isim

A      Ali
B     Ayşe
C    Fatma
D     Veli
Name: isim, dtype: object

In [115]:
df["isim"]

A      Ali
B     Ayşe
C    Fatma
D     Veli
Name: isim, dtype: object

In [117]:
df["isim"]

A      Ali
B     Ayşe
C    Fatma
D     Veli
Name: isim, dtype: object

In [118]:
df.columns

Index(['isim', 'boy cm', 'kilo-kg'], dtype='object')

In [119]:
df.boy cm

SyntaxError: invalid syntax (1165061042.py, line 1)

In [120]:
df["boy cm"]

A    170
B    160
C    170
D    180
Name: boy cm, dtype: int64

In [121]:
df.kilo-kg

AttributeError: 'DataFrame' object has no attribute 'kilo'

In [124]:
df["kilo-kg"]

A    70
B    55
C    60
D    80
Name: kilo-kg, dtype: int64

In [125]:
df[["kilo-kg", "boy cm"]]

   kilo-kg  boy cm
A       70     170
B       55     160
C       60     170
D       80     180

In [126]:
df["A"]

KeyError: 'A'

In [127]:
df

    isim  boy cm  kilo-kg
A    Ali     170       70
B   Ayşe     160       55
C  Fatma     170       60
D   Veli     180       80

In [128]:
df["A" : "C"]

    isim  boy cm  kilo-kg
A    Ali     170       70
B   Ayşe     160       55
C  Fatma     170       60

In [129]:
df[0:2]

   isim  boy cm  kilo-kg
A   Ali     170       70
B  Ayşe     160       55

## Creating a New Column

In [130]:
df

    isim  boy cm  kilo-kg
A    Ali     170       70
B   Ayşe     160       55
C  Fatma     170       60
D   Veli     180       80

In [137]:
df["BMI"] = round(df["kilo-kg"] / ((df["boy cm"] / 100) ** 2),2)
df

    isim  boy cm  kilo-kg    BMI
A    Ali     170       70  24.22
B   Ayşe     160       55  21.48
C  Fatma     170       60  20.76
D   Veli     180       80  24.69

In [138]:
df.new = np.arange(4)

C:\Users\bahad\AppData\Local\Temp\ipykernel_15672\120318653.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df.new = np.arange(4)

In [143]:
df["new"] = np.arange(4)
df

    isim  boy cm  kilo-kg    BMI  new
A    Ali     170       70  24.22    0
B   Ayşe     160       55  21.48    1
C  Fatma     170       60  20.76    2
D   Veli     180       80  24.69    3

In [144]:
df = pd.read_csv("adult_eda.csv")
df

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13.0,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13.0,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9.0,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7.0,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13.0,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32556,27,Private,257302,Assoc-acdm,12.0,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
32557,40,Private,154374,HS-grad,9.0,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
32558,58,Private,151910,HS-grad,9.0,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
32559,22,Private,201490,HS-grad,9.0,Never-married,Adm-clerical,NaN,White,Male,0,0,20,United-States,<=50K
32560,52,Self-emp-inc,287927,HS-grad,9.0,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

In [145]:
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13.0,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13.0,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9.0,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7.0,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13.0,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [146]:
df.tail()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
32556,27,Private,257302,Assoc-acdm,12.0,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
32557,40,Private,154374,HS-grad,9.0,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
32558,58,Private,151910,HS-grad,9.0,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
32559,22,Private,201490,HS-grad,9.0,Never-married,Adm-clerical,NaN,White,Male,0,0,20,United-States,<=50K
32560,52,Self-emp-inc,287927,HS-grad,9.0,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

In [147]:
df.dtype  # pandas Series için bu.

AttributeError: 'DataFrame' object has no attribute 'dtype'

In [148]:
df.dtypes

age                 int64
workclass          object
fnlwgt              int64
education          object
education-num     float64
marital-status     object
occupation         object
relationship       object
race               object
sex                object
capital-gain        int64
capital-loss        int64
hours-per-week      int64
native-country     object
salary             object
dtype: object

In [149]:
df.size

488415

In [150]:
32561 * 15

488415

In [151]:
df

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13.0,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13.0,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9.0,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7.0,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13.0,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32556,27,Private,257302,Assoc-acdm,12.0,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
32557,40,Private,154374,HS-grad,9.0,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
32558,58,Private,151910,HS-grad,9.0,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
32559,22,Private,201490,HS-grad,9.0,Never-married,Adm-clerical,NaN,White,Male,0,0,20,United-States,<=50K
32560,52,Self-emp-inc,287927,HS-grad,9.0,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

In [152]:
df.shape

(32561, 15)

In [153]:
df.ndim

2

In [159]:
df.sample(10)

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
22694,36,State-gov,143385,Some-college,10.0,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,<=50K
888,54,Self-emp-not-inc,406468,HS-grad,9.0,Married-civ-spouse,Sales,Husband,Black,Male,0,0,40,United-States,<=50K
29495,38,Private,161016,Some-college,10.0,Divorced,Prof-specialty,Not-in-family,White,Female,0,0,32,United-States,<=50K
30669,41,Self-emp-inc,177905,Bachelors,13.0,Married-civ-spouse,Exec-managerial,Husband,White,Male,7688,0,70,United-States,>50K
23425,35,Private,126675,HS-grad,9.0,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,48,United-States,<=50K
15575,40,Private,230961,Some-college,10.0,Married-civ-spouse,Sales,Husband,White,Male,0,0,40,United-States,<=50K
3607,41,Self-emp-not-inc,227065,Some-college,10.0,Separated,Craft-repair,Not-in-family,White,Male,0,0,40,United-States,<=50K
2038,49,State-gov,213307,Some-college,10.0,Married-civ-spouse,Prof-specialty,Husband,White,Male,0,0,40,United-States,<=50K
21947,49,Private,262116,Prof-school,15.0,Married-civ-spouse,Prof-specialty,Husband,White,Male,0,0,48,United-States,<=50K
14310,30,Private,261677,9th,5.0,Never-married,Handlers-cleaners,Unmarried,Black,Male,0,0,40,United-States,<=50K

In [160]:
df.isnull()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32556,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
32557,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
32558,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
32559,False,False,False,False,False,False,False,True,False,False,False,False,False,False,False
32560,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False

In [161]:
df.isnull().sum()

age                  0
workclass            0
fnlwgt               0
education            0
education-num      802
marital-status       0
occupation           0
relationship      5068
race                 0
sex                  0
capital-gain         0
capital-loss         0
hours-per-week       0
native-country       0
salary               0
dtype: int64

In [162]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   fnlwgt          32561 non-null  int64
 3   education       32561 non-null  object
 4   education-num   31759 non-null  float64
 5   marital-status  32561 non-null  object
 6   occupation      32561 non-null  object
 7   relationship    27493 non-null  object
 8   race            32561 non-null  object
 9   sex             32561 non-null  object
 10  capital-gain    32561 non-null  int64
 11  capital-loss    32561 non-null  int64
 12  hours-per-week  32561 non-null  int64
 13  native-country  32561 non-null  object
 14  salary          32561 non-null  object
dtypes: float64(1), int64(5), object(9)
memory usage: 3.7+ MB